app/views/users/likes.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
    <% @likes.each do |like| %>
      <% post = Post.find_by(id: like.post_id) %>