app/views/posts/show.html.erb

      </div>
      <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 6 AND `likes`.`post_id` = 23 LIMIT 1