app/controllers/likes_controller.rb

INSERT INTO `likes` (`user_id`, `post_id`, `created_at`, `updated_at`) VALUES (2, 2, '2021-04-06 08:52:32.763720', '2021-04-06 08:52:32.763720')
---
    def create
        @like = Like.new(
            user_id: @current_user.id,
            post_id: params[:post_id]
        )
        @like.save

SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 2 AND `likes`.`post_id` = 2 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
    def destroy
        @like = Like.find_by(
            user_id: @current_user.id,
            post_id: params[:post_id]
        )
        @like.destroy