app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
SELECT `posts`.* FROM `posts` WHERE (content LIKE '%マーケティング論%' )
---
  def index
    @posts = Post.all.order(created_at: :desc)
    if params[:search] == nil
      @posts= Post.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 28 LIMIT 1
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 28
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count

INSERT INTO `posts` (`content`, `created_at`, `updated_at`, `user_id`, `attend`, `exam`, `homework`, `comment`) VALUES ('マーケティング論', '2021-04-23 13:11:22.242483', '2021-04-23 13:11:22.242483', 8, '講義終わりの紙', '記述式のテスト\r\n持ち込みは出来ないが、事前に問題は教えてくれる　', 'ほぼない', '粟島先生は神。\r\n自分で自分のことを「仏の粟島」という。\r\nそんな人が単位を出さないわけがない。')
---
  def create
    @post = Post.new(
      content: params[:content],
      attend: params[:attend],
      exam: params[:exam],
      homework: params[:homework],
      comment: params[:comment],
      user_id: @current_user.id
    )
    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1  [["id", 4], ["LIMIT", 1]]
UPDATE `posts` SET `posts`.`content` = 'test.', `posts`.`attend` = 'test.', `posts`.`exam` = 'test.', `posts`.`homework` = 'test.', `posts`.`comment` = 'test.', `posts`.`updated_at` = '2021-05-14 05:30:08.954179' WHERE `posts`.`id` = 1
---
  def update
    @post = Post.find_by(id: params[:id])

    @post.content = params[:content]
    @post.attend = params[:attend]
    @post.exam = params[:exam]
    @post.homework = params[:homework]
    @post.comment = params[:comment]

    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 28 LIMIT 1  [["id", 28], ["LIMIT", 1]]
DELETE FROM `posts` WHERE `posts`.`id` = 28
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 28 LIMIT 1
---
  def ensure_correct_user
    @post = Post.find_by(id: params[:id])