app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name:"default_user.jpg",
      password: params[:password]
      )
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password`) VALUES ('EE', 'E@E', '2021-04-05 11:46:21.912397', '2021-04-05 11:46:21.912397', 'default_user.jpg', 'EE')

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end
    if @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `users`.`image_name` = '2.jpg', `users`.`updated_at` = '2021-04-05 15:13:16.554558' WHERE `users`.`id` = 2

  def login
    @user = User.find_by(email: params[:email],password: params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'P@P' AND `users`.`password` = 'PP' LIMIT 1

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 2