app/models/post.rb

    def user
        return User.find_by(id: self.user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]